{
  "taxon_id": "AngMaFaFb0001-00",
  "conservation_status": "Least Concern (LC)",
  "general_description": "A. cochliocarpos is a shrub or small tree that can grow up to 8-10 meters tall. It has two distinct forms: a coastal form exceeding 10 meters in height and an inland form up to 4 meters tall with smaller, tougher leaflets. The species has deep green, fernlike foliage with bipinnately compound leaves.",
  "habitat": "Coastal woodland on sandy substrates, inland scrubby areas, open grassy slopes, savanna habitats (disturbed mata de cipo, caatinga, cerrado, campo rupestre), areas of secondary vegetation.",
  "elevation_ranges": "200-1,300 meters above sea level",
  "compatible_soil_types": "Sandy substrates in coastal areas; variety of soil types found in savanna and scrub habitats.",
  "ecological_function": "As a legume, it likely fixes nitrogen in the soil, provides food and habitat for wildlife, contributes to forest structure and biodiversity.",
  "native_adapted_habitats": "Endemic to eastern Brazil, occurring in the states of Alagoas, Bahia, Paraíba, Pernambuco, Rio de Janeiro, Rio Grande do Norte and São Paulo. Adapted to both coastal and inland habitats within the Atlantic Forest and Caatinga biomes.",
  "agroforestry_use_cases": "Potential for use in restoration and conservation efforts, reforestation of degraded areas in its native range, inclusion in mixed-species plantings to increase biodiversity, possible use in silvopastoral systems due to its nitrogen-fixing ability.",
  "growth_form": "Tree or shrub",
  "leaf_type": "Bipinnately compound leaves with a deep-green fernlike appearance",
  "deciduous_evergreen": "Evergreen",
  "flower_color": null,
  "fruit_type": "Spiraled fruit with ferrugineous pulverulent indumentum on the epicarp",
  "bark_characteristics": "Bark contains lenticels",
  "maximum_height": 10,
  "maximum_diameter": null,
  "lifespan": null,
  "maximum_tree_age": null,
  "research_metadata": {
    "researcher_wallet": "0x1ee6a2bb0c64396cd0548dF4f51b1e09350111be",
    "research_date": "2025-03-24T07:02:08.011Z",
    "research_method": "AI-assisted (Perplexity + GPT-4o)",
    "verification_status": "unverified"
  }
}